In [1]:
# Import dependencies
import sqlite3
import pandas as pd
import numpy as np
from numpy import nan

In [2]:
# Connect to database
conn = sqlite3.connect('database.sqlite')

In [3]:
# Read sqlite query results into a pandas DataFrame
coordinate_df = pd.read_sql_query('SELECT * from coordinate_table',conn)
coordinate_df.head()

   index State   Latitude   Longitude        City
0      0    AL  32.601011  -86.680736     Alabama
1      1    AK  61.302501 -158.775020      Alaska
2      2    AZ  34.168219 -111.930907     Arizona
3      3    AR  34.751928  -92.131378    Arkansas
4      4    CA  37.271875 -119.270415  California

# Northeast Center Coordinates

In [4]:
# Read sqlite query results into a pandas DataFrame
ne_df = pd.read_sql_query("""SELECT
'northeast' as division,
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('CT', 'ME', 'MA', 'NH', 'RI', 'VT', 'NJ', 'NY', 'PA')
""",conn);

ne_df

    division   Latitude  Longitude
0  northeast  42.233242 -72.815566

# Midwest Center Coordinates

In [5]:
# Read sqlite query results into a pandas DataFrame
mw_df = pd.read_sql_query("""SELECT
'midwest' as division,
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('IL', 'IN', 'MI', 'OH', 'WI', 'IA', 'KS', 'MN', 'MS', 'NE', 'ND', 'SD')
""",conn);

mw_df

  division   Latitude  Longitude
0  midwest  41.839268 -92.503343

# South Center Coordinates

In [6]:
# Read sqlite query results into a pandas DataFrame
s_df = pd.read_sql_query("""SELECT
'south' as division,
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('DE', 'FL', 'GA', 'MD', 'NC', 'SC', 'VA', 'DC', 'WV', 'AL', 'KY', 'MS', 'TN', 'AR', 'LA', 'OK', 'TX')
""",conn);

s_df

  division   Latitude  Longitude
0    south  34.959489 -85.170362

# West Center Coordinates

In [7]:
# Read sqlite query results into a pandas DataFrame
wc_df = pd.read_sql_query("""SELECT
'west' as division,
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('AZ', 'CO', 'ID', 'MT', 'NV', 'NM', 'UT', 'WY', 'AK', 'CA', 'HI', 'OR', 'WA')
""",conn);

wc_df

  division   Latitude   Longitude
0     west  40.198808 -116.686347

# Center Coordinate for Each Division

In [8]:
# Read sqlite query results into a pandas DataFrame
us_div_coordinate_df = pd.read_sql_query("""SELECT
'northeast' as division,
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('CT', 'ME', 'MA', 'NH', 'RI', 'VT', 'NJ', 'NY', 'PA')

union

SELECT
'midwest' as division,
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('IL', 'IN', 'MI', 'OH', 'WI', 'IA', 'KS', 'MN', 'MS', 'NE', 'ND', 'SD')

union

SELECT
'south' as division,
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('DE', 'FL', 'GA', 'MD', 'NC', 'SC', 'VA', 'DC', 'WV', 'AL', 'KY', 'MS', 'TN', 'AR', 'LA', 'OK', 'TX')

union

SELECT
'west' as division,
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('AZ', 'CO', 'ID', 'MT', 'NV', 'NM', 'UT', 'WY', 'AK', 'CA', 'HI', 'OR', 'WA')


""",conn);

us_div_coordinate_df

    division   Latitude   Longitude
0    midwest  41.839268  -92.503343
1  northeast  42.233242  -72.815566
2      south  34.959489  -85.170362
3       west  40.198808 -116.686347

# Load test1_table

In [9]:
# Read sqlite query results into a pandas DataFrame
test_df = pd.read_sql_query('SELECT * from test1_table',conn)
test_df.head()

   index category gender    age  year     region  population
0      0       TV   male  18-24  2013  northeast     5808930
1      1       TV   male  25-34  2013  northeast     8031355
2      2       TV   male  35-44  2013  northeast     8555839
3      3       TV   male  45-54  2013  northeast     7762506
4      4       TV   male    55+  2013  northeast     4188397

In [17]:
test_complete_df = pd.merge(us_div_coordinate_df, test_df, how = 'left', left_on = 'division', right_on = 'region')

test_complete_df = test_complete_df.drop(['index','region'],  axis=1)

test_complete_df.head()

  division   Latitude  Longitude category gender    age  year  population
0  midwest  41.839268 -92.503343       TV   male  18-24  2013    12609544
1  midwest  41.839268 -92.503343       TV   male  25-34  2013    14207771
2  midwest  41.839268 -92.503343       TV   male  35-44  2013     8068669
3  midwest  41.839268 -92.503343       TV   male  45-54  2013     7706571
4  midwest  41.839268 -92.503343       TV   male    55+  2013    13947056

In [19]:
# Save data frame to csv
test_complete_df.to_csv('clean_data/test_complete_data.csv')